u1n11/M55M1_Mix_ZO_Trainer/SampleCode/MachineLearning/ImageClassification/Model/inference_mngt.cpp
#include <cstdio>
#include <cstring>
#include <cinttypes>
#include <string>
#include <vector>

/* MobileNetModel.hpp defines USE_SPLIT_MODEL — must be included before
 * inference_mngt.h so the conditional enum values are compiled in. */
#include "MobileNetModel.hpp"
#include "inference_mngt.h"
#include "../GlobalState.hpp"
#include "LogConfig.hpp"

#if defined(USE_SPLIT_MODEL) && (USE_SPLIT_MODEL == 1)
#include "ZOTrainer.hpp"
#endif

#undef PI
#include "NuMicro.h"
#include "log_macros.h"

#include "BufAttributes.hpp"
#include "Labels.hpp"

#if defined (__USE_DISPLAY__)
    #include "Display.h"
#endif
#if defined(__PROFILE__)
    #include "Profiler.hpp"
#endif
#include "pmu_counter.h"

/* ------------------------------------------------------------------ */
/*  External / Shared defines                                         */
/* ------------------------------------------------------------------ */
namespace arm
{
namespace app
{
extern uint8_t tensorArena[ACTIVATION_BUF_SZ];
extern uint8_t cpuTensorArena[];

#if !(defined(USE_SPLIT_MODEL) && (USE_SPLIT_MODEL == 1))
/* Optional getter function for the model pointer and its size. */
namespace mobilenet
{
extern uint8_t *GetModelPointer();
extern size_t GetModelLen();
} /* namespace mobilenet */
#endif /* !USE_SPLIT_MODEL */

} /* namespace app */
} /* namespace arm */

extern char fb_array[]; /* frame buffer array defined in main.cpp */

/* ------------------------------------------------------------------ */
/*  Split model namespace externs                                     */
/* ------------------------------------------------------------------ */
#if defined(USE_SPLIT_MODEL) && (USE_SPLIT_MODEL == 1)
namespace arm {
namespace app {
namespace feature_extractor_npu {
    extern const uint8_t *GetModelPointer();
    extern size_t GetModelLen();
}
namespace classifier_cpu_int8 {
    extern const uint8_t *GetModelPointer();
    extern size_t GetModelLen();
}
} /* namespace app */
} /* namespace arm */
#endif /* USE_SPLIT_MODEL */

/* ------------------------------------------------------------------ */
/*  State Machine Variables                                           */
/* ------------------------------------------------------------------ */
static ISM_State_t g_currentState = ISM_IDLE;
static ISM_State_t g_requestState = ISM_IDLE;
static bool g_modelLoadFailed = false; /* set after Init() fails; prevents crash-inducing retry */

#if defined(USE_SPLIT_MODEL) && (USE_SPLIT_MODEL == 1)
static bool g_zoLoadedFromFlash = false;
static uint32_t g_zoPersistedTrainSteps = 0;
#endif

/* ------------------------------------------------------------------ */
/*  Helper Functions (Internal)                                       */
/* ------------------------------------------------------------------ */

static std::string BuildTopKResultString(const std::vector<arm::app::ClassificationResult> &vec,
                                         size_t topK)
{
    if (vec.empty())
    {
        return std::string("???");
    }

    const size_t count = (vec.size() < topK) ? vec.size() : topK;
    std::string text;

    for (size_t i = 0; i < count; ++i)
    {
        if (i > 0)
        {
            text += std::string(", ");
        }
        text += vec[i].m_label + std::string(" ") + std::to_string(vec[i].m_normalisedVal);
    }

    return text;
}

#if !(defined(USE_SPLIT_MODEL) && (USE_SPLIT_MODEL == 1))

static void DoLoadModel(void)
{
    if (modelLoaded)
    {
        info("[ISM] Model already loaded\r\n");
        return;
    }

    if (g_modelLoadFailed)
    {
        printf_err("[ISM] Model previously failed to load. Reset MCU to retry.\r\n");
        return;
    }

    info_if_token(LOG_MODEL_LOAD, "[ISM] Loading model...\r\n");

    extern uint32_t SystemCoreClock;
    const uint64_t t0 = pmu_get_systick_Count();

    /* Detect whether the model is for NPU (has EthosU custom ops) or CPU-only.
     * NPU model uses internal SRAM arena; CPU model uses external HyperRAM arena. */
    const uint8_t *modelPtr = arm::app::mobilenet::GetModelPointer();
    size_t         modelLen = arm::app::mobilenet::GetModelLen();
    const tflite::Model *fbModel = ::tflite::GetModel(modelPtr);

    bool isNpuModel = false;
    if (fbModel && fbModel->subgraphs() && fbModel->subgraphs()->size() > 0)
    {
        const auto *subgraph = fbModel->subgraphs()->Get(0);
        const auto *opcodes  = fbModel->operator_codes();
        if (subgraph && subgraph->operators() && opcodes)
        {
            for (uint32_t i = 0; i < subgraph->operators()->size(); i++)
            {
                const auto *op     = subgraph->operators()->Get(i);
                const auto *opcode = opcodes->Get(op->opcode_index());
                if (opcode && tflite::GetBuiltinCode(opcode) == tflite::BuiltinOperator_CUSTOM
                    && opcode->custom_code()
                    && std::strstr(opcode->custom_code()->c_str(), "ethos") != nullptr)
                {
                    isNpuModel = true;
                    break;
                }
            }
        }
    }

    uint8_t *arenaPtr;
    uint32_t arenaSize;
    if (isNpuModel)
    {
        arenaPtr  = arm::app::tensorArena;
        arenaSize = sizeof(arm::app::tensorArena);
        info_if_token(LOG_MODEL_LOAD, "[ISM] Using SRAM tensor arena (%u bytes)\r\n", arenaSize);
    }
    else
    {
        arenaPtr  = arm::app::cpuTensorArena;
        arenaSize = CPU_ACTIVATION_BUF_SZ;
        info_if_token(LOG_MODEL_LOAD, "[ISM] Using HyperRAM tensor arena (%u bytes) at 0x%p\r\n", arenaSize, arenaPtr);
    }

    /* Dump all operator types required by this model for diagnostics */
    if (fbModel && fbModel->operator_codes())
    {
        const auto *opcodes = fbModel->operator_codes();
        info_if_token(LOG_MODEL_LOAD, "[ISM] Model requires %u operator type(s):\r\n", (unsigned)opcodes->size());
        for (uint32_t i = 0; i < opcodes->size(); i++)
        {
            const auto *opcode = opcodes->Get(i);
            auto builtinCode = tflite::GetBuiltinCode(opcode);
            if (builtinCode == tflite::BuiltinOperator_CUSTOM)
            {
                const char *name = opcode->custom_code() ? opcode->custom_code()->c_str() : "CUSTOM";
                info_if_token(LOG_MODEL_LOAD, "[ISM]   [%u] CUSTOM: %s\r\n", i, name);
            }
            else
            {
                info_if_token(LOG_MODEL_LOAD, "[ISM]   [%u] %s\r\n", i, tflite::EnumNameBuiltinOperator(builtinCode));
            }
        }
    }

    /* Check quantization of CONV_2D / DEPTHWISE_CONV_2D filter tensors */
    if (fbModel && fbModel->subgraphs() && fbModel->subgraphs()->size() > 0)
    {
        const auto *subgraph = fbModel->subgraphs()->Get(0);
        const auto *operators = subgraph->operators();
        const auto *tensors   = subgraph->tensors();
        const auto *opcodes   = fbModel->operator_codes();

        if (operators && tensors && opcodes)
        {
            info_if_token(LOG_MODEL_LOAD, "[ISM] Checking conv/fc filter quantization...\r\n");
            for (uint32_t i = 0; i < operators->size(); i++)
            {
                const auto *op = operators->Get(i);
                const auto *opcode = opcodes->Get(op->opcode_index());
                auto code = tflite::GetBuiltinCode(opcode);

                if (code != tflite::BuiltinOperator_CONV_2D &&
                    code != tflite::BuiltinOperator_DEPTHWISE_CONV_2D &&
                    code != tflite::BuiltinOperator_FULLY_CONNECTED)
                    continue;

                const char *opName = tflite::EnumNameBuiltinOperator(code);

