u1n11/M55M1_Mix_ZO_Trainer/SampleCode/MachineLearning/ImageClassification/Model/inference_mngt.cpp
        size_t arenaUsed = model.GetArenaUsedBytes();
        uint64_t elapsed = pmu_get_systick_Count() - t0;
        float elapsedMs = (float)elapsed * 1000.0f / (float)SystemCoreClock;
        info_critical("[LOAD] time=%.2fms mem=%zu/%uB zo=N/A\r\n",
                  elapsedMs, arenaUsed, arenaSize);
        info_if_token(LOG_MODEL_INIT, "[ISM] Model loaded success\r\n");
    }
}

static void DoInference(void)
{
    if (!modelLoaded)
    {
        info("[ISM] Model not loaded, loading now...\r\n");
        DoLoadModel();
        if (!modelLoaded) return;
    }

    /* Freeze frameBuffer to ensure consistent inference frame */
    extern uint32_t inferenceFrameCount;
    extern bool frameBufferFrozen;
    inferenceFrameCount++;
    frameBufferFrozen = true;

    /* Resize framebuffer image to model input */
    image_t resizeImg;

    roi.x = 0;
    roi.y = 0;
    roi.w = frameBuffer.w;
    roi.h = frameBuffer.h;

    resizeImg.w = inputImgCols;
    resizeImg.h = inputImgRows;
    resizeImg.data = (uint8_t *)inputTensor->data.data; // direct resize to input tensor buffer
    resizeImg.pixfmt = PIXFORMAT_RGB888;

    imlib_nvt_scale(&frameBuffer, &resizeImg, &roi);

    /* Pre-processing */
    if (!preProcess->DoPreProcess(resizeImg.data, (resizeImg.w * resizeImg.h * inputChannels)))
    {
        printf_err("[ISM] Pre-processing failed\r\n");
        extern bool frameBufferFrozen;
        frameBufferFrozen = false;
        return;
    }

    /* Run inference with timing */
    extern uint32_t SystemCoreClock;
    uint64_t t0 = pmu_get_systick_Count();

    if (!model.RunInference())
    {
        printf_err("[ISM] Inference failed\r\n");
    }
    else
    {
        uint64_t elapsed = pmu_get_systick_Count() - t0;
        uint32_t elapsed_us = (uint32_t)(elapsed * 1000000ULL / SystemCoreClock);

        /* Post-processing */
        std::string predictLabelInfo;
        std::string top5LabelInfo;

        if (postProcess->DoPostProcess())
        {
            top5LabelInfo = BuildTopKResultString(results, 5);
            predictLabelInfo = BuildTopKResultString(results, 1);
        }
        else
        {
            top5LabelInfo = std::string("???");
            predictLabelInfo = std::string("???");
        }

        /* Report result with timing via UART */
        char timingBuf[16];
        snprintf(timingBuf, sizeof(timingBuf), "%.2fms", elapsed_us / 1000.0f);
        info_critical("[FRAME: %u] [RESULT] %s (%s)\r\n", inferenceFrameCount, top5LabelInfo.c_str(), timingBuf);

        /* Update global result string for persistent display in main loop */
        lastInferenceResult = predictLabelInfo + std::string(" (") + timingBuf + std::string(")");
    }

    /* Unfreeze frameBuffer after inference completes */
    frameBufferFrozen = false;
}

#endif /* !USE_SPLIT_MODEL */

/* ------------------------------------------------------------------ */
/*  Split-model: Load & Inference                                     */
/* ------------------------------------------------------------------ */
#if defined(USE_SPLIT_MODEL) && (USE_SPLIT_MODEL == 1)

namespace {

constexpr uint32_t kZoFlashMagic = 0x5A4F5452UL; /* 'ZOTR' */
constexpr uint32_t kZoFlashVersion = 1UL;
constexpr uint32_t kZoFlashReservedPages = 4UL;
constexpr uint32_t kZoFlashRegionAddr = FMC_APROM_END - (kZoFlashReservedPages * FMC_FLASH_PAGE_SIZE);
constexpr size_t kZoFlashRegionBytes = (size_t)kZoFlashReservedPages * FMC_FLASH_PAGE_SIZE;

struct ZoFlashHeader
{
    uint32_t magic;
    uint32_t version;
    uint32_t payloadBytes;
    uint32_t stepCount;
    uint32_t inputFeatures;
    uint32_t outputClasses;
    uint32_t payloadChecksum;
    uint32_t reserved;
};

static uint32_t CalcFnv1a(const uint8_t *data, size_t len)
{
    uint32_t hash = 2166136261UL;

    for (size_t i = 0; i < len; ++i)
    {
        hash ^= data[i];
        hash *= 16777619UL;
    }

    return hash;
}

static void FlashReadBytes(uint32_t addr, uint8_t *dst, size_t len)
{
    if (!dst || len == 0)
    {
        return;
    }

    /* APROM is memory mapped, so direct read is robust across resets and
     * does not depend on FMC ISP enable state. */
    const uint8_t *src = reinterpret_cast<const uint8_t *>(addr);
    std::memcpy(dst, src, len);
}

static bool FlashWriteBytes(uint32_t addr, const uint8_t *src, size_t len)
{
    if (!src)
    {
        return false;
    }

    int32_t rc = 0;
    bool ok = false;

    SYS_UnlockReg();
    FMC_Open();
    FMC_ENABLE_AP_UPDATE();

    size_t written = 0;
    while (written < len)
    {
        const uint32_t pageAddr = addr + (uint32_t)written;
        size_t pageBytes = len - written;
        if (pageBytes > FMC_FLASH_PAGE_SIZE)
        {
            pageBytes = FMC_FLASH_PAGE_SIZE;
        }

        rc = FMC_Erase(pageAddr);
        if (rc != 0)
        {
            goto cleanup;
        }

        for (size_t off = 0; off < pageBytes; off += 4)
        {
            uint32_t word = 0xFFFFFFFFUL;
            size_t chunk = ((pageBytes - off) >= 4) ? 4 : (pageBytes - off);
            std::memcpy(&word, src + written + off, chunk);

            rc = FMC_Write(pageAddr + (uint32_t)off, word);
            if (rc != 0)
            {
                goto cleanup;
            }
        }

        written += pageBytes;
    }

    ok = true;

cleanup:
    FMC_DISABLE_AP_UPDATE();
    FMC_Close();
    SYS_LockReg();
    return ok;
}

static bool FlashErasePages(uint32_t addr, size_t totalBytes)
{
    int32_t rc = 0;
    bool ok = false;

    if (totalBytes == 0 || (totalBytes % FMC_FLASH_PAGE_SIZE) != 0)
    {
        return false;
    }

    SYS_UnlockReg();
    FMC_Open();
    FMC_ENABLE_AP_UPDATE();

    for (size_t off = 0; off < totalBytes; off += FMC_FLASH_PAGE_SIZE)
    {
        rc = FMC_Erase(addr + (uint32_t)off);
        if (rc != 0)
        {
            goto cleanup;
        }
    }

    ok = true;

cleanup:
    FMC_DISABLE_AP_UPDATE();
    FMC_Close();
    SYS_LockReg();
    return ok;
}

static bool SaveZOTrainerSnapshotToFlash(void)
{
    if (!zoTrainer || !zoTrainer->IsInitialized())
    {
        printf_err("[ZO] Cannot save: trainer not initialised\r\n");
        return false;
    }

    const ZOTrainer::FCInfo &fc = zoTrainer->GetFCInfo();
    const size_t payloadBytes = (size_t)fc.weight_bytes + (size_t)fc.bias_bytes;
    const size_t totalBytes = sizeof(ZoFlashHeader) + payloadBytes;

    if (totalBytes > kZoFlashRegionBytes)
    {
        printf_err("[ZO] Snapshot too large for reserved APROM region (%u > %u)\r\n",
                   (unsigned int)totalBytes, (unsigned int)kZoFlashRegionBytes);
        return false;
    }

    const int8_t *weights = zoTrainer->GetMutableWeights();
    const int32_t *bias = zoTrainer->GetMutableBias();
    if (!weights)
    {
        printf_err("[ZO] Cannot save: mutable weights pointer is null\r\n");
        return false;
    }

    std::vector<uint8_t> snapshot(totalBytes, 0x00);
    ZoFlashHeader hdr{};
    hdr.magic = kZoFlashMagic;
    hdr.version = kZoFlashVersion;
    hdr.payloadBytes = (uint32_t)payloadBytes;
    hdr.stepCount = (uint32_t)zoTrainer->GetStepCount();
    hdr.inputFeatures = (uint32_t)fc.input_features;
    hdr.outputClasses = (uint32_t)fc.output_classes;

