u1n11/M55M1_Mix_ZO_Trainer/SampleCode/MachineLearning/ImageClassification/Model/inference_mngt.cpp
    std::memcpy(snapshot.data() + sizeof(ZoFlashHeader), weights, (size_t)fc.weight_bytes);
    if (fc.bias_bytes > 0)
    {
        if (!bias)
        {
            printf_err("[ZO] Cannot save: mutable bias pointer is null\r\n");
            return false;
        }
        std::memcpy(snapshot.data() + sizeof(ZoFlashHeader) + (size_t)fc.weight_bytes,
                    bias, (size_t)fc.bias_bytes);
    }

    hdr.payloadChecksum = CalcFnv1a(snapshot.data() + sizeof(ZoFlashHeader), payloadBytes);
    std::memcpy(snapshot.data(), &hdr, sizeof(ZoFlashHeader));

    if (!FlashWriteBytes(kZoFlashRegionAddr, snapshot.data(), snapshot.size()))
    {
        printf_err("[ZO] Failed to save snapshot to APROM flash\r\n");
        return false;
    }

    g_zoPersistedTrainSteps = hdr.stepCount;
    info_critical("[ZO] Snapshot saved to flash @0x%08X (steps=%u)\r\n",
                  kZoFlashRegionAddr, hdr.stepCount);
    return true;
}

static bool TryLoadZOTrainerSnapshotFromFlash(void)
{
    if (!zoTrainer || !zoTrainer->IsInitialized())
    {
        return false;
    }

    ZoFlashHeader hdr{};
    FlashReadBytes(kZoFlashRegionAddr, reinterpret_cast<uint8_t *>(&hdr), sizeof(hdr));

    const ZOTrainer::FCInfo &fc = zoTrainer->GetFCInfo();
    const uint32_t expectedPayload = (uint32_t)((size_t)fc.weight_bytes + (size_t)fc.bias_bytes);

    if (hdr.magic != kZoFlashMagic || hdr.version != kZoFlashVersion)
    {
        info_if_token(LOG_ZO_TRAINING,
                      "[ZO] Flash header invalid: magic=0x%08X version=%u (expect 0x%08X/%u)\r\n",
                      hdr.magic, hdr.version, kZoFlashMagic, kZoFlashVersion);
        g_zoLoadedFromFlash = false;
        g_zoPersistedTrainSteps = 0;
        return false;
    }

    if (hdr.payloadBytes > (kZoFlashRegionBytes - sizeof(ZoFlashHeader)))
    {
        printf_err("[ZO] Flash snapshot payload too large; using built-in weights\r\n");
        g_zoLoadedFromFlash = false;
        g_zoPersistedTrainSteps = 0;
        return false;
    }

    if (hdr.payloadBytes != expectedPayload ||
        hdr.inputFeatures != (uint32_t)fc.input_features ||
        hdr.outputClasses != (uint32_t)fc.output_classes)
    {
        printf_err("[ZO] Flash snapshot header mismatch; using built-in weights\r\n");
        g_zoLoadedFromFlash = false;
        g_zoPersistedTrainSteps = 0;
        return false;
    }

    std::vector<uint8_t> payload(hdr.payloadBytes, 0);
    FlashReadBytes(kZoFlashRegionAddr + (uint32_t)sizeof(ZoFlashHeader),
                   payload.data(), payload.size());

    const uint32_t checksum = CalcFnv1a(payload.data(), payload.size());
    if (checksum != hdr.payloadChecksum)
    {
        printf_err("[ZO] Flash snapshot checksum mismatch; using built-in weights\r\n");
        g_zoLoadedFromFlash = false;
        g_zoPersistedTrainSteps = 0;
        return false;
    }

    const int8_t *w = reinterpret_cast<const int8_t *>(payload.data());
    const uint8_t *b = payload.data() + (size_t)fc.weight_bytes;

    if (!zoTrainer->LoadFromSnapshot(w, (size_t)fc.weight_bytes, b,
                                     (size_t)fc.bias_bytes, (int)hdr.stepCount))
    {
        printf_err("[ZO] Failed to apply flash snapshot; using built-in weights\r\n");
        g_zoLoadedFromFlash = false;
        g_zoPersistedTrainSteps = 0;
        return false;
    }

    g_zoLoadedFromFlash = true;
    g_zoPersistedTrainSteps = hdr.stepCount;
    info_critical("[ZO] Loaded classifier snapshot from flash (steps=%u)\r\n", hdr.stepCount);
    return true;
}

} // namespace

static void DoZOInit(void);

static void DoLoadSplitModel(void)
{
    if (splitModelLoaded)
    {
        info("[ISM] Split models already loaded\r\n");
        return;
    }

    if (g_modelLoadFailed)
    {
        printf_err("[ISM] Model previously failed to load. Reset MCU to retry.\r\n");
        return;
    }

    info_if_token(LOG_MODEL_LOAD, "[ISM] Loading split models (extractor + classifier)...\r\n");

    extern uint32_t SystemCoreClock;
    const uint64_t t0 = pmu_get_systick_Count();

    /* ---- Feature Extractor (NPU → SRAM arena) ---- */
    const uint8_t *extPtr  = arm::app::feature_extractor_npu::GetModelPointer();
    size_t         extLen  = arm::app::feature_extractor_npu::GetModelLen();
    uint8_t       *extArena     = arm::app::tensorArena;
    uint32_t       extArenaSize = sizeof(arm::app::tensorArena);

    info_if_token(LOG_MODEL_LOAD, "[ISM] Feature extractor: %zu bytes, SRAM arena %u bytes\r\n",
         extLen, extArenaSize);

    if (!extractorModel.Init(extArena, extArenaSize, extPtr, extLen))
    {
        printf_err("[ISM] Failed to init feature extractor model\r\n");
        g_modelLoadFailed = true;
        return;
    }

    /* ---- Classifier (CPU → HyperRAM arena) ---- */
    const uint8_t *clsPtr  = arm::app::classifier_cpu_int8::GetModelPointer();
    size_t         clsLen  = arm::app::classifier_cpu_int8::GetModelLen();
    uint8_t       *clsArena     = arm::app::cpuTensorArena;
    uint32_t       clsArenaSize = CPU_ACTIVATION_BUF_SZ;

    info_if_token(LOG_MODEL_LOAD, "[ISM] Classifier: %zu bytes, HyperRAM arena %u bytes at 0x%p\r\n",
         clsLen, clsArenaSize, clsArena);

    /* Quick HyperRAM sanity test */
    {
        volatile uint32_t *p;
        const uint32_t testPattern = 0xDEADBEEF;
        const uint32_t offsets[] = { 0, clsArenaSize / 2, clsArenaSize - 4 };

        info_if_token(LOG_HYPERRAM_TEST, "[ISM] HyperRAM sanity test...\r\n");
        for (int t = 0; t < 3; t++)
        {
            p = (volatile uint32_t *)(clsArena + offsets[t]);
            *p = testPattern;
            uint32_t readback = *p;
            if (readback != testPattern)
            {
                printf_err("[ISM] HyperRAM FAIL at 0x%p: wrote 0x%08X read 0x%08X\r\n",
                           p, testPattern, readback);
                g_modelLoadFailed = true;
                return;
            }
        }
        info_if_token(LOG_HYPERRAM_TEST, "[ISM] HyperRAM OK\r\n");
    }

    if (!classifierModel.Init(clsArena, clsArenaSize, clsPtr, clsLen))
    {
        printf_err("[ISM] Failed to init classifier model\r\n");
        g_modelLoadFailed = true;
        return;
    }

