u1n11/M55M1_Mix_ZO_Trainer/SampleCode/MachineLearning/ImageClassification/Model/inference_mngt.cpp
    /* ---- Verify intermediate tensor compatibility ---- */
    TfLiteTensor *extOutput = extractorModel.GetOutputTensor(0);
    TfLiteTensor *clsInput  = classifierModel.GetInputTensor(0);

    info_if_token(LOG_MODEL_LOAD, "[ISM] Extractor output: %zu bytes, Classifier input: %zu bytes\r\n",
         extOutput->bytes, clsInput->bytes);

    if (extOutput->bytes != clsInput->bytes)
    {
        printf_err("[ISM] Shape mismatch! extractor output %zu != classifier input %zu\r\n",
                   extOutput->bytes, clsInput->bytes);
        g_modelLoadFailed = true;
        return;
    }

    /* ---- MPU: mark both arenas as write-through cacheable ---- */
    const std::vector<ARM_MPU_Region_t> mpuConfig =
    {
        {
            /* SRAM tensor arena (extractor / NPU) */
            ARM_MPU_RBAR(((unsigned int)extArena),
                         ARM_MPU_SH_NON, 0, 1, 1),
            ARM_MPU_RLAR((((unsigned int)extArena) + extArenaSize - 1),
                         eMPU_ATTR_CACHEABLE_WTRA)
        },
        {
            /* HyperRAM tensor arena (classifier / CPU) */
            ARM_MPU_RBAR(((unsigned int)clsArena),
                         ARM_MPU_SH_NON, 0, 1, 1),
            ARM_MPU_RLAR((((unsigned int)clsArena) + clsArenaSize - 1),
                         eMPU_ATTR_CACHEABLE_WTRA)
        },
#if defined (__USE_CCAP__)
        {
            ARM_MPU_RBAR(((unsigned int)fb_array),
                         ARM_MPU_SH_NON, 0, 1, 1),
            ARM_MPU_RLAR((((unsigned int)fb_array) + OMV_FB_SIZE - 1),
                         eMPU_ATTR_NON_CACHEABLE)
        }
#endif
    };
    InitPreDefMPURegion(&mpuConfig[0], mpuConfig.size());

    /* ---- Setup image input from extractor ---- */
    inputTensor = extractorModel.GetInputTensor(0);

    if (!inputTensor->dims || inputTensor->dims->size < 3)
    {
        printf_err("[ISM] Invalid extractor input tensor dims\r\n");
        g_modelLoadFailed = true;
        return;
    }

    TfLiteIntArray *inputShape = extractorModel.GetInputShape(0);
    inputImgCols  = inputShape->data[arm::app::MobileNetModel::ms_inputColsIdx];
    inputImgRows  = inputShape->data[arm::app::MobileNetModel::ms_inputRowsIdx];
    inputChannels = inputShape->data[arm::app::MobileNetModel::ms_inputChannelsIdx];

    GetLabelsVector(labels);

    /* Pre-process feeds the extractor; post-process reads the classifier */
    preProcess  = new arm::app::ImgClassPreProcess(&extractorModel);
    postProcess = new arm::app::ImgClassPostProcess(classifier, &classifierModel,
                                                    labels, results);

    splitModelLoaded = true;
    modelLoaded      = true; /* backward compat flag */

    g_zoLoadedFromFlash = false;
    g_zoPersistedTrainSteps = 0;

    /* Auto-restore persisted ZO snapshot on model load so reboot + load_model
     * immediately reuses trained classifier parameters if available. */
    DoZOInit();

    const size_t extUsed = extractorModel.GetArenaUsedBytes();
    const size_t clsUsed = classifierModel.GetArenaUsedBytes();
    const size_t totalUsed = extUsed + clsUsed;
    const size_t totalArena = (size_t)extArenaSize + (size_t)clsArenaSize;
    uint64_t elapsed = pmu_get_systick_Count() - t0;
    float elapsedMs = (float)elapsed * 1000.0f / (float)SystemCoreClock;
    const char *zoState = g_zoLoadedFromFlash ? "YES" : "NO";
    info_critical("[LOAD] time=%.2fms mem=%zu/%zuB zo=%s\r\n",
                  elapsedMs, totalUsed, totalArena, zoState);
    info_if_token(LOG_MODEL_INIT, "[ISM] Split models loaded successfully\r\n");
}

static void DoSplitInference(void)
{
    if (!splitModelLoaded)
    {
        info("[ISM] Split models not loaded, loading now...\r\n");
        DoLoadSplitModel();
        if (!splitModelLoaded) return;
    }

    /* Freeze frameBuffer to ensure consistent inference frame */
    extern uint32_t inferenceFrameCount;
    extern bool frameBufferFrozen;
    inferenceFrameCount++;
    frameBufferFrozen = true;

    /* ---- Resize camera frame → extractor input ---- */
    image_t resizeImg;

    roi.x = 0;
    roi.y = 0;
    roi.w = frameBuffer.w;
    roi.h = frameBuffer.h;

    resizeImg.w = inputImgCols;
    resizeImg.h = inputImgRows;
    resizeImg.data = (uint8_t *)inputTensor->data.data;
    resizeImg.pixfmt = PIXFORMAT_RGB888;

    imlib_nvt_scale(&frameBuffer, &resizeImg, &roi);

    /* Pre-processing (image → extractor input tensor) */
    if (!preProcess->DoPreProcess(resizeImg.data,
                                  (resizeImg.w * resizeImg.h * inputChannels)))
    {
        printf_err("[ISM] Pre-processing failed\r\n");
        extern bool frameBufferFrozen;
        frameBufferFrozen = false;
        return;
    }

    extern uint32_t SystemCoreClock;

    /* ---- Stage 1: Feature Extractor (NPU) ---- */
    uint64_t t0 = pmu_get_systick_Count();

    if (!extractorModel.RunInference())
    {
        printf_err("[ISM] Feature extractor inference failed\r\n");
        extern bool frameBufferFrozen;
        frameBufferFrozen = false;
        return;
    }

    uint64_t t_ext = pmu_get_systick_Count() - t0;

    /* ---- Copy intermediate features: extractor output → classifier input ---- */
    TfLiteTensor *extOutput = extractorModel.GetOutputTensor(0);
    TfLiteTensor *clsInput  = classifierModel.GetInputTensor(0);
    std::memcpy(clsInput->data.data, extOutput->data.data, extOutput->bytes);

    /* ---- Stage 2: Classifier (CPU) ---- */
    uint64_t t1 = pmu_get_systick_Count();

    if (!classifierModel.RunInference())
    {
        printf_err("[ISM] Classifier inference failed\r\n");
        extern bool frameBufferFrozen;
        frameBufferFrozen = false;
        return;
    }

    uint64_t t_cls   = pmu_get_systick_Count() - t1;
    uint64_t t_total = pmu_get_systick_Count() - t0;

    /* ---- Post-processing (classifier output → label) ---- */
    std::string predictLabelInfo;
    std::string top5LabelInfo;
    if (postProcess->DoPostProcess())
    {
        top5LabelInfo = BuildTopKResultString(results, 5);
        predictLabelInfo = BuildTopKResultString(results, 1);
    }
    else
    {
        top5LabelInfo = std::string("???");
        predictLabelInfo = std::string("???");
    }

    uint32_t ext_us   = (uint32_t)(t_ext   * 1000000ULL / SystemCoreClock);
    uint32_t cls_us   = (uint32_t)(t_cls   * 1000000ULL / SystemCoreClock);
    uint32_t total_us = (uint32_t)(t_total * 1000000ULL / SystemCoreClock);

