u1n11/M55M1_Mix_ZO_Trainer/SampleCode/MachineLearning/ImageClassification/Model/inference_mngt.cpp
    char totalTimingBuf[16];
    char splitTimingBuf[48];
    snprintf(totalTimingBuf, sizeof(totalTimingBuf), "%.2fms", total_us / 1000.0f);
    snprintf(splitTimingBuf, sizeof(splitTimingBuf), "ext:%.2f+cls:%.2f",
             ext_us / 1000.0f, cls_us / 1000.0f);

    info_critical("[FRAME: %u] [RESULT] %s (%s) (%s)\r\n", inferenceFrameCount, top5LabelInfo.c_str(), totalTimingBuf,
                  splitTimingBuf);
    lastInferenceResult = predictLabelInfo + std::string(" (") + totalTimingBuf + std::string(") (")
                      + splitTimingBuf + std::string(")");

    /* Unfreeze frameBuffer after inference completes */
    frameBufferFrozen = false;
}

/* ------------------------------------------------------------------ */
/*  ZO Training: Init and Train                                       */
/* ------------------------------------------------------------------ */

static void DoZOInit(void)
{
    /* Ensure split model is loaded first */
    if (!splitModelLoaded)
    {
        info("[ZO] Split model not loaded, loading now...\r\n");
        DoLoadSplitModel();
        if (!splitModelLoaded) return;
    }

    /* If we haven't yet re-initialised the classifier with preserve_all_tensors,
     * we need to re-init it. The first load uses the standard allocator path.
     * On zo_init we reload using preserveAllTensors=true. */
    const uint8_t *clsPtr      = arm::app::classifier_cpu_int8::GetModelPointer();
    size_t         clsLen      = arm::app::classifier_cpu_int8::GetModelLen();
    uint8_t       *clsArena    = arm::app::cpuTensorArena;
    uint32_t       clsArenaSize = CPU_ACTIVATION_BUF_SZ;

    info_if_token(LOG_ZO_TRAINING, "[ZO] Re-initialising classifier with preserve_all_tensors=true...\r\n");

    /* Reinitialise classifierModel to preserve all tensors */
    if (!classifierModel.Init(clsArena, clsArenaSize, clsPtr, clsLen,
                              nullptr, /* allocator */
                              true     /* preserveAllTensors */))
    {
        printf_err("[ZO] Failed to re-init classifier with preserve_all_tensors\r\n");
        return;
    }

    /* Update postProcess to use the freshly initialised classifier model */
    if (postProcess) {
        delete postProcess;
    }
    postProcess = new arm::app::ImgClassPostProcess(classifier, &classifierModel,
                                                    labels, results);

    /* Allocate ZOTrainer if not yet done */
    if (!zoTrainer) {
        zoTrainer = new ZOTrainer();
    }

    /* Calculate scratch buffer start: arena base + arena used + 1KB alignment guard */
    size_t arenaUsed    = classifierModel.GetArenaUsedBytes();
    size_t guardBytes   = 1024u;
    uint8_t* scratchBuf = clsArena + arenaUsed + guardBytes;
    size_t   scratchSz  = (size_t)clsArenaSize - arenaUsed - guardBytes;

    if (!zoTrainer->Init(classifierModel, scratchBuf, scratchSz))
    {
        printf_err("[ZO] ZOTrainer init failed\r\n");
        return;
    }

    if (!TryLoadZOTrainerSnapshotFromFlash())
    {
        info_critical("[ZO] Weight source: BUILTIN (no valid flash snapshot)\r\n");
    }
    else
    {
        info_critical("[ZO] Weight source: FLASH\r\n");
    }

    const ZOTrainer::FCInfo& fc = zoTrainer->GetFCInfo();
    info_critical("[ZO] Ready. FC[%d in × %d out], mem=%zu bytes\r\n",
         fc.input_features, fc.output_classes, zoTrainer->GetMemoryUsed());
    info_if_token(LOG_ZO_TRAINING, "[ZO] Commands: tra=<label>  zo_reset  zo_set_lr <val>  zo_set_q <val>\r\n");
}

static void DoZOTrain(void)
{
    if (!zoTrainer || !zoTrainer->IsInitialized())
    {
        printf_err("[ZO] Trainer not initialised. Send 'zo_init' first.\r\n");
        return;
    }

    if (zoTargetLabel < 0 || zoTargetLabel >= zoTrainer->GetFCInfo().output_classes)
    {
        printf_err("[ZO] Invalid target label index %d\r\n", zoTargetLabel);
        return;
    }

    /* Freeze frameBuffer to ensure consistent training frame */
    extern uint32_t inferenceFrameCount;
    extern bool frameBufferFrozen;
    inferenceFrameCount++;
    frameBufferFrozen = true;

    /* ---- Extract features from current camera frame ---- */
    if (!splitModelLoaded)
    {
        printf_err("[ZO] Split model not loaded\r\n");
        return;
    }

    /* Resize camera frame → extractor input */
    image_t resizeImg;
    roi.x = 0;
    roi.y = 0;
    roi.w = frameBuffer.w;
    roi.h = frameBuffer.h;

    resizeImg.w      = inputImgCols;
    resizeImg.h      = inputImgRows;
    resizeImg.data   = (uint8_t *)inputTensor->data.data;
    resizeImg.pixfmt = PIXFORMAT_RGB888;

    imlib_nvt_scale(&frameBuffer, &resizeImg, &roi);

    if (!preProcess->DoPreProcess(resizeImg.data,
                                  (resizeImg.w * resizeImg.h * inputChannels)))
    {
        printf_err("[ZO] Pre-processing failed\r\n");
        extern bool frameBufferFrozen;
        frameBufferFrozen = false;
        return;
    }

    /* Run feature extractor (NPU) */
    if (!extractorModel.RunInference())
    {
        printf_err("[ZO] Feature extractor failed\r\n");
        extern bool frameBufferFrozen;
        frameBufferFrozen = false;
        return;
    }

    /* Copy features → classifier input */
    TfLiteTensor *extOutput = extractorModel.GetOutputTensor(0);
    TfLiteTensor *clsInput  = classifierModel.GetInputTensor(0);
    std::memcpy(clsInput->data.data, extOutput->data.data, extOutput->bytes);

    /* Cache FC input vector — runs classifier once, no more NPU calls in TrainStep */
    if (!zoTrainer->CacheFeature(classifierModel))
    {
        printf_err("[ZO] CacheFeature failed\r\n");
        frameBufferFrozen = false;
        return;
    }

    /* ---- Run one ZO training step (CPU-only node perturbation) ---- */
    extern uint32_t SystemCoreClock;
    uint64_t t0 = pmu_get_systick_Count();

    float loss = zoTrainer->TrainStep(classifierModel, zoTargetLabel,
                                      zoLearningRate, zoNumPerturbations);

    uint64_t elapsed_cyc = pmu_get_systick_Count() - t0;
    uint32_t elapsed_us  = (uint32_t)(elapsed_cyc * 1000000ULL / SystemCoreClock);

    const std::string& labelName = labels[(size_t)zoTargetLabel];
    info_critical("[FRAME: %u] [ZO] Step %d | Label: %s(%d) | Loss: %.4f | Time: %.2fms | Mem: %zu bytes\r\n",
         inferenceFrameCount,
         zoTrainer->GetStepCount(),
         labelName.c_str(), zoTargetLabel,
         loss,
         elapsed_us / 1000.0f,
         zoTrainer->GetMemoryUsed());

    info_if_token(LOG_ZO_TRAINING, "[ZO] Snapshot not auto-saved. Send 'zo_save' to persist to APROM flash.\r\n");

    /* Unfreeze frameBuffer after training completes */
    frameBufferFrozen = false;
}

int ISM_ZO_SaveToFlash(void)
{
    return SaveZOTrainerSnapshotToFlash() ? 1 : 0;
}

int ISM_ZO_ClearFlash(void)
{
    if (!FlashErasePages(kZoFlashRegionAddr, kZoFlashRegionBytes))
    {
        printf_err("[ZO] Failed to erase persisted snapshot from APROM flash\r\n");
        return 0;
    }

    g_zoLoadedFromFlash = false;
    g_zoPersistedTrainSteps = 0;
    info_critical("[ZO] Persisted snapshot erased from flash @0x%08X\r\n", kZoFlashRegionAddr);
    return 1;
}

void ISM_ZO_PrintStatus(void)
{
    if (!zoTrainer || !zoTrainer->IsInitialized())
    {
        info("[ZO] Status: trainer=NOT_INITIALISED\r\n");
        return;
    }

    const char *source = g_zoLoadedFromFlash ? "FLASH" : "BUILTIN";
    info_critical("[ZO] Status: trainer=READY, source=%s, runtime_steps=%d, flash_steps=%u\r\n",
                  source, zoTrainer->GetStepCount(), g_zoPersistedTrainSteps);
}

#endif /* USE_SPLIT_MODEL */

